backend/ruby/app/graphql/types/mutation_type.rb

INSERT INTO "users" ("name", "username", "email", "password", "role", "created_at", "updated_at", "bio") VALUES ('Calvin', 'calvin345', NULL, NULL, NULL, '2024-09-09 14:03:49.748342', '2024-09-09 14:03:49.748342', 'Hi, I''m Calvin!') RETURNING "id"
---
      def createUser(name:,username:,bio:)
        User.create name: name, username: username, bio: bio

INSERT INTO "posts" ("user_id", "picture", "body", "created_at", "updated_at") VALUES (11, NULL, 'This is a post', '2024-09-09 14:08:17.111338', '2024-09-09 14:08:17.111338') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."id" = 11 ORDER BY "users"."id" ASC LIMIT 1
---
      def createPost(userId:,body:)
        post = Post.create body: body
        user = User.where(id: userId).first

INSERT INTO "comments" ("user_id", "post_id", "created_at", "updated_at", "body") VALUES (8, 18, '2024-09-09 14:12:36.968887', '2024-09-09 14:12:36.968887', 'Happy comment!') RETURNING "id"
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 18 ORDER BY "posts"."id" ASC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 8 ORDER BY "users"."id" ASC LIMIT 1
---
      def createComment(userId:,postId:,body:)
        comment = Comment.create body: body
        post = Post.where(id: postId).first
        user = User.where(id: userId).first

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 17 ORDER BY "posts"."id" ASC LIMIT 1
UPDATE "posts" SET "body" = 'yyy', "updated_at" = '2024-09-09 14:17:50.083365' WHERE "posts"."id" = 17
---
      def updatePost(id:,body:)
        post = Post.where(id: id).first
        post.update body: body

SELECT "comments".* FROM "comments" WHERE "comments"."id" = 5 ORDER BY "comments"."id" ASC LIMIT 1
UPDATE "comments" SET "updated_at" = '2024-09-09 14:17:08.410524', "body" = 'xxx' WHERE "comments"."id" = 5
---
      def updateComment(id:,body:)
        comment = Comment.where(id: id).first
        comment.update body: body

SELECT "users".* FROM "users" WHERE "users"."id" = 11 ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 11
DELETE FROM "posts" WHERE "posts"."id" = 16
SELECT "users".* FROM "users" WHERE "users"."id" = 11
---
      def deleteUser(id:)
        user = User.where(id: id).first
        user.likes.destroy_all
        user.comments.destroy_all
        user.posts.destroy_all
        User.where(id: id).destroy_all

SELECT "comments".* FROM "comments" WHERE "comments"."id" = 5
DELETE FROM "comments" WHERE "comments"."id" = 5
---
      def deleteComment(id:)
        comment = Comment.where(id: id).first
        Comment.where(id: id).destroy_all