backend/ruby/app/graphql/types/query_type.rb

    def users
      User.all
---
SELECT "users".* FROM "users"

    def posts
      Post.all
---
SELECT "posts".* FROM "posts"