backend/ruby/app/graphql/types/user_type.rb

    def numberOfAuthoredPosts
      object.posts.length()
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 32

    def numberOfAuthoredComments
      object.comments.length()
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = 32

    def numberOfAuthoredLikes
      object.likes.length()
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = 32

    def numberOfReceivedComments
      amount = 0
      for post in object.posts do
        amount += post.comments.length()
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1

    def numberOfReceivedLikes
      amount = 0
      for post in object.posts do
        amount += post.likes.length()
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = 1